[
  {
    "id": "bestbuy-19156189",
    "category": "Laptops",
    "title": "ASUS Vivobook 16 16\" Laptop - Indie Black (Intel Core i5-13420H/16GB RAM/512GB SSD/Windows 11)",
    "price": "$649.99",
    "description": "Experience seamless everyday computing with the ASUS Vivobook 16 laptop. Powered by the Intel Core i5-13420H processor and 16GB DDR4 RAM, it ensures smooth multitasking. The 16-inch WUXGA (1920 x 1200) display with NanoEdge ultra-thin bezels offers immersive visuals, while its MIL-STD 810H military-grade certification guarantees exceptional reliability.",
    "features": [
      "ASUS Vivobook 16 (X1605) laptop",
      "Adapter",
      "Warranty card",
      "Manual",
      "Intel Core i5-13420H processor and 16GB DDR4 RAM deliver fast, responsive performance for smooth multitasking and demanding applications",
      "512GB solid-state drive offers fast data access, quick boot times, and ample storage for your files and applications",
      "16-inch screen with WUXGA (1920 x 1200) resolution, NanoEdge ultra-thin bezels, and a 16:10 aspect ratio provides a spacious, immersive viewing experience",
      "Certified by TUV Rheinland for low blue light, ensuring eye protection during extended use",
      "Wi-Fi 6E(802.11ax) (Dual band) 2 x 2, and Bluetooth 5.3 wireless card (Bluetooth version may change with OS version) provide reliable, high-speed wireless connectivity and improved Bluetooth performance",
      "One USB 3.2 Gen 1 Type-C, one USB 3.2 Gen 1 Type-A, one USB 2.0 Type-A, a HDMI 1.4, and a combo audio jack offer more options for connecting external devices (USB transfer speed may vary. Learn more at the ASUS website)",
      "180-degree hinge, ASUS ErgoSense chiclet keyboard with a numeric keypad, optimal click ratio, and a larger multi-finger touchpad significantly enhance your work efficiency",
      "ASUS AI noise cancellation technology uses machine learning to separate unwanted noise from human speech, ensuring your voice is heard clearly during conference calls",
      "Fingerprint sensor and an HD camera with a privacy shutter improve security",
      "ASUS Antimicrobial Guard Plus (disclaimer: learn more at the ASUS website) protects frequently touched surfaces for improved hygiene",
      "Weighing just 1.88kg (4.14lb.) and measuring only 1.99cm (0.78\") in thickness, it offers exceptional mobility and a seamless finish for a smooth touch experience",
      "Preloaded with Windows 11 Home operating system that features easy user interface"
    ],
    "url": "https://bestbuy.ca/en-ca/product/asus-vivobook-16-16-laptop-indie-black-intel-core-i5-13420h-16gb-ram-512gb-ssd-windows-11/19156189",
    "rating": "3.8",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:12:29.939096",
    "summary": "Experience seamless computing with the ASUS Vivobook 16 laptop, featuring an Intel Core i5-13420H processor and 16GB DDR4 RAM for fast multitasking. Enjoy immersive visuals on the 16-inch WUXGA display with NanoEdge bezels, while the MIL-STD 810H certification ensures exceptional reliability. Stay connected with Wi-Fi 6E and Bluetooth 5.3, and enhance work efficiency with features like ASUS AI noise cancellation and ErgoSense chiclet keyboard.",
    "tagline": "Effortless Performance, Immersive Experience.",
    "highlights": [
      "Intel Core i5 processor and 16GB RAM for fast, responsive multitasking",
      "512GB SSD for quick data access and ample storage",
      "16-inch WUXGA display with NanoEdge bezels for immersive visuals",
      "TUV Rheinland certified for low blue light, ensuring eye protection",
      "ASUS AI noise cancellation and fingerprint sensor for enhanced security and communication"
    ]
  },
  {
    "id": "bestbuy-17937123",
    "category": "Laptops",
    "title": "ASUS Vivobook 16\" Laptop - Indie Black (Intel Core i7-1355U/16GB RAM/1TB SSD/Windows 11) - English",
    "price": "$1099.99",
    "description": "Experience computing like never before with the ASUS Vivobook 16 laptop. Featuring a powerful Intel Core i7-1355U processor and 16GB of RAM, this laptop ensures lightning-fast performance. The massive 1TB SSD provides ample storage for your files. Its 16\" WUXGA IPS display delivers breathtaking visuals with vibrant colours and sharp details, making it perfect for work and play.",
    "features": [
      "45W AC Adapter",
      "User Manual",
      "Warranty Card",
      "13th generation Intel Core i7-1355U CPU and 16GB DDR4 RAM enable smooth and efficient handling of even the most demanding applications",
      "1TB SSD offers incredibly fast load times and ample storage space, allowing you to quickly access and store all your files",
      "16-inch WUXGA (1920 x 1200) IPS display provides stunningly clear and vibrant visuals, perfect for both work and entertainment",
      "NanoEdge ultra-thin bezels and 16:10 aspect ratio immerse you in visuals with an impressive 86% screen-to-body ratio",
      "Wi-Fi 6E (802.11ax) and Bluetooth 5.3 wireless card offer faster, more reliable internet and seamless device connectivity",
      "Sleek and lightweight design with just 1.88kg (4.14lb.) weight and 1.99cm (0.78in.) thickness makes it effortlessly portable and stylish",
      "One USB 3.2 Gen 1 Type-C (support power delivery), two USB 3.2 Gen 1 Type-A, one USB 2.0 Type-A, one HDMI 1.4, and one 3.5mm combo audio jack allow easy connectivity with all your existing peripherals, displays, and projectors",
      "180-degree hinge allows you to lay the laptop flat, offering versatile viewing angles and easy collaboration with others",
      "Fingerprint sensor and 720p HD camera with a convenient privacy shutter, make sure your data and personal space remain protected at all times",
      "ASUS AI noise cancellation isolates unwanted noise from human speech for enhanced communication and improved conferencing experience",
      "TUV Rheinland certification ensures low-blue light for eye care during extended use",
      "ASUS ErgoSense Chiclet keyboard with Num-key, optimal click ratio, and a larger multi-finger touchpad boost your work efficiency",
      "ASUS Antimicrobial Guard strategically applied to high-touch areas, provide an extra layer of protection for enhanced hygiene and cleanliness",
      "Meets MIL-STD 810H military standards to guarantee unmatched reliability in harsh conditions",
      "Preloaded Windows 11 Home offers a seamless and intuitive user experience with its advanced features and enhancements"
    ],
    "url": "https://bestbuy.ca/en-ca/product/asus-vivobook-16-laptop-indie-black-intel-core-i7-1355u-16gb-ram-1tb-ssd-windows-11-english/17937123",
    "rating": "4.2",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:13:04.328634",
    "summary": "Experience unparalleled computing performance with the ASUS Vivobook 16 laptop. Powered by a 13th generation Intel Core i7-1355U CPU and 16GB DDR4 RAM, this laptop effortlessly handles demanding tasks. Enjoy stunning visuals on the 16\" WUXGA IPS display, while the 1TB SSD provides lightning-fast load times and ample storage.",
    "tagline": "Unleash Power and Portability with ASUS Vivobook 16",
    "highlights": [
      "Intel Core i7-1355U CPU & 16GB RAM for seamless performance",
      "1TB SSD for lightning-fast load times and ample storage",
      "16\" WUXGA IPS display for stunning visuals",
      "Wi-Fi 6E & Bluetooth 5.3 for fast, reliable connectivity",
      "Sleek, lightweight design with advanced security features"
    ]
  },
  {
    "id": "bestbuy-18657889",
    "category": "Laptops",
    "title": "ASUS ZenBook 14 OLED Laptop (14\" FHD+ Touchscreen, Intel 14-Core Ultra 5 125H) 8GB DDR5 RAM, 512GB SSD, AI PC, 15-Hr Long Battery Life, FHD Webcam, Windows 11 Home W/ AI Copilot",
    "price": "$899.99",
    "description": "We offer a 1-year warranty on your product.Our remarkably sleek Zenbook 14 OLED is there with you — the ultimate ultraportable laptop that takes sophistication to a whole new level. Discover new heights for speed and efficiency with the top-tier Intel Core Ultra 5 processor—taking you seamlessly from day to night on its all-day 75Wh battery. Immerse your senses on a gorgeous 14\" ASUS Lumina OLED touchscreen and powerful new Super-linear speakers tuned by Harman Kardon.",
    "features": [
      "ASUS ZenBook 14 OLED Laptop65W AC Adapter with Power CordUser Manual"
    ],
    "url": "https://bestbuy.ca/en-ca/product/asus-zenbook-14-oled-laptop-14-fhd-touchscreen-intel-14-core-ultra-5-125h-8gb-ddr5-ram-512gb-ssd-ai-pc-15-hr-long-battery-life-fhd-webcam-windows-11-home-w-ai-copilot/18657889",
    "rating": "4.7",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:13:38.057813",
    "summary": "Experience unparalleled sophistication and speed with our ASUS ZenBook 14 OLED Laptop, equipped with a top-tier Intel Core Ultra 5 processor and a stunning 14\" ASUS Lumina OLED touchscreen. Enjoy all-day productivity with its 75Wh battery and immerse yourself in crystal-clear sound from the new Super-linear speakers tuned by Harman Kardon. Plus, enjoy peace of mind with our 1-year warranty included.",
    "tagline": "Elevate Your Efficiency with Zenbook 14 OLED",
    "highlights": [
      "1-year warranty for peace of mind",
      "Intel Core Ultra 5 processor for top-tier performance",
      "All-day 75Wh battery for extended use",
      "Stunning 14\" ASUS Lumina OLED touchscreen",
      "Super-linear speakers tuned by Harman Kardon for immersive audio"
    ]
  },
  {
    "id": "bestbuy-19263405",
    "category": "Laptops",
    "title": "Microsoft Surface Pro (LCD) Copilot+ PC 12\" 512GB Tablet with Snapdragon X Plus/16GB RAM (2025) - Violet - Device Only",
    "price": "$1349.99",
    "description": "Stay productive and creative, on the go, with this ultra-thin Microsoft Surface Pro 12\" tablet. Light and flexible, you can use it as a tablet or turn it into a laptop for comfortable typing1. Featuring an immersive PixelSense Flow LCD touchscreen and Qualcomm Snapdragon X Plus processor, this machine helps you do more in less time. Plus, possibilities are endless with advanced AI capabilities.",
    "features": [
      "Device",
      "USB-C Charging Cable",
      "QSG",
      "Safety And Warranty Documents (No Charger Included)",
      "Enjoy exclusive Copilot+ PC experiences for productivity and efficiency boosts (on some devices, Copilot+ PC experiences require free updates available starting later this year and continuing into 2025)",
      "Powered by the Qualcomm Snapdragon X Plus (eight core) processor, delivering powerful performance and AI accelerated power",
      "Features turbocharged Qualcomm Hexagon NPU that delivers up to 45 TOPs designed to accelerate AI experiences",
      "12-inch tablet with PixelSense Flow LCD touchscreen display offers stunning, vibrant visuals and image quality",
      "Stay in the flow—whether you're streaming shows, YouTube, movies, or even video calls, enjoy up to 16 hours of battery (battery life varies significantly based on usage, network and feature configuration, signal strength, settings and other factors)",
      "Charge on-the-go, transfer data fast, or create the ultimate desktop set up with two USB-C 3.2 ports (USB4 and USB-C are registered trademarks of USB Implementers Forum)",
      "Store and charge Surface Slim Pen1 directly in the new pen storage area on the back of Surface Pro",
      "Designed to be a laptop or a tablet, the built-in 165-degree fluid kickstand offers flexibility at any angle",
      "Pair with a Surface Pro 12-inch keyboard1 to turn it into a full thin and light Windows laptop with a comfortable typing and touchpad experience",
      "Instantly access your device using facial recognition with Windows Hello; fast, personal, secure and no password needed",
      "Power supply is now sold separately to support Microsoft's sustainability promise"
    ],
    "url": "https://bestbuy.ca/en-ca/product/microsoft-surface-pro-lcd-copilot-pc-12-512gb-tablet-with-snapdragon-x-plus-16gb-ram-2025-violet-device-only/19263405",
    "rating": "0",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:14:13.251842",
    "summary": "Introducing the ultra-thin Microsoft Surface Pro 12\" tablet, powered by the Qualcomm Snapdragon X Plus processor for powerful performance and AI acceleration. Enjoy up to 16 hours of battery life and stunning visuals on the PixelSense Flow LCD touchscreen display. With features like USB-C ports, pen storage, and Windows Hello facial recognition, this versatile device seamlessly transitions from tablet to laptop for maximum productivity on the go.",
    "tagline": "Unleash limitless creativity with Surface Pro's AI-powered versatility.",
    "highlights": [
      "Transform between tablet and laptop for seamless productivity",
      "Stunning 12\" PixelSense Flow LCD touchscreen display",
      "Qualcomm Snapdragon X Plus processor for powerful performance",
      "Up to 16 hours of battery life for uninterrupted work and entertainment",
      "Pair with Surface Pro accessories for a complete user experience"
    ]
  },
  {
    "id": "bestbuy-19263403",
    "category": "Laptops",
    "title": "Microsoft Surface Pro (LCD) Copilot+ PC 12\" 512GB Tablet with Snapdragon X Plus/16GB RAM (2025) - Ocean - Device Only",
    "price": "$1349.99",
    "description": "Stay productive and creative, on the go, with this ultra-thin Microsoft Surface Pro 12\" tablet. Light and flexible, you can use it as a tablet or turn it into a laptop for comfortable typing1. Featuring an immersive PixelSense Flow LCD touchscreen and Qualcomm Snapdragon X Plus processor, this machine helps you do more in less time. Plus, possibilities are endless with advanced AI capabilities.",
    "features": [
      "Device",
      "USB-C Charging Cable",
      "QSG",
      "Safety And Warranty Documents (No Charger Included)",
      "Enjoy exclusive Copilot+ PC experiences for productivity and efficiency boosts (on some devices, Copilot+ PC experiences require free updates available starting later this year and continuing into 2025)",
      "Powered by the Qualcomm Snapdragon X Plus (eight core) processor, delivering powerful performance and AI accelerated power",
      "Features turbocharged Qualcomm Hexagon NPU that delivers up to 45 TOPs designed to accelerate AI experiences",
      "12-inch tablet with PixelSense Flow LCD touchscreen display offers stunning, vibrant visuals and image quality",
      "Stay in the flow—whether you're streaming shows, YouTube, movies, or even video calls, enjoy up to 16 hours of battery (battery life varies significantly based on usage, network and feature configuration, signal strength, settings and other factors)",
      "Charge on-the-go, transfer data fast, or create the ultimate desktop set up with two USB-C 3.2 ports (USB4 and USB-C are registered trademarks of USB Implementers Forum)",
      "Store and charge Surface Slim Pen1 directly in the new pen storage area on the back of Surface Pro",
      "Designed to be a laptop or a tablet, the built-in 165-degree fluid kickstand offers flexibility at any angle",
      "Pair with a Surface Pro 12-inch keyboard1 to turn it into a full thin and light Windows laptop with a comfortable typing and touchpad experience",
      "Instantly access your device using facial recognition with Windows Hello; fast, personal, secure and no password needed",
      "Power supply is now sold separately to support Microsoft's sustainability promise"
    ],
    "url": "https://bestbuy.ca/en-ca/product/microsoft-surface-pro-lcd-copilot-pc-12-512gb-tablet-with-snapdragon-x-plus-16gb-ram-2025-ocean-device-only/19263403",
    "rating": "0",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:14:47.354928",
    "summary": "Maximize your productivity with the ultra-thin Microsoft Surface Pro 12\" tablet featuring a Qualcomm Snapdragon X Plus processor for powerful performance and AI acceleration. Enjoy vibrant visuals on the PixelSense Flow LCD touchscreen display and up to 16 hours of battery life for uninterrupted work or entertainment. Upgrade your efficiency with exclusive Copilot+ PC experiences and turn your tablet into a laptop with the Surface Pro 12-inch keyboard for a seamless typing experience.",
    "tagline": "Unleash Your Productivity Anywhere, Anytime.",
    "highlights": [
      "Transform between tablet and laptop for versatile productivity.",
      "Qualcomm Snapdragon X Plus processor for powerful performance and AI acceleration.",
      "Stunning 12-inch PixelSense Flow LCD touchscreen display.",
      "Up to 16 hours of battery life for extended usage.",
      "USB-C ports for fast charging and data transfer, plus Surface Slim Pen storage."
    ]
  },
  {
    "id": "bestbuy-19265465",
    "category": "Laptops",
    "title": "Microsoft Surface Laptop 13\" Copilot+ PC Laptop - Violet (Snapdragon X Plus/16GB RAM/512GB UFS) - EN",
    "price": "$1499.99",
    "description": "Take your projects anywhere with this 13\" Microsoft Surface laptop, a smart, portable machine that keeps up. Featuring super-long battery life, you can keep going all day with no interruptions. This Copilot+ PC with turbocharged NPU delivers powerful performance and AI accelerated power. Plus, enjoy an immersive viewing experience with the stunning PixelSense Flow display.",
    "features": [
      "Surface Laptop",
      "USB-C Charging Cable",
      "USB-C Wall Charger",
      "Quick Start Guide",
      "Safety/Warranty Documents",
      "Experience Copilot+ PC, the fastest, smartest Surface laptop ever. Save time on everyday tasks with exclusive Copilot+ PC experiences (on some devices, Copilot+ PC experiences require free updates available starting later this year and continuing into 2025. Timing varies by device and region)",
      "Blazing-fast Qualcomm Hexagon NPU delivers up to 45 TOPS, running AI-powered apps smoothly and efficiently",
      "Powered by the Qualcomm SnapdragonX Plus (eight core) processor, providing powerful performance and AI accelerated power",
      "Immerse yourself in vibrant visuals on its PixelSense Flow LED touchscreen display",
      "With up to 23 hours of battery life, you can watch your favourite movies and shows from start to finish without needing to recharge. Perfect for long flights, road trips, and more (battery life varies significantly based on usage, network and feature configuration, signal strength, settings and other factors)",
      "Two USB-C 3.2 ports let you charge on-the-go, transfer data quickly, or create the ultimate desktop set up (USB4 and USB-C are registered trademarks of USB Implementers Forum)",
      "Massive, precision touchpad for productivity boost and optimal key travel for quick, accurate typing",
      "Access the laptop instantly with your fingerprint; fast, secure, and no password needed",
      "Power supply is included"
    ],
    "url": "https://bestbuy.ca/en-ca/product/microsoft-surface-laptop-13-copilot-pc-laptop-violet-snapdragon-x-plus-16gb-ram-512gb-ufs-en/19265465",
    "rating": "0",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:15:22.086964",
    "summary": "Introducing the 13\" Microsoft Surface laptop - a powerhouse on-the-go with super-long battery life for uninterrupted productivity. Experience the Copilot+ PC with turbocharged NPU, delivering powerful performance and AI accelerated power, along with a stunning PixelSense Flow display for an immersive viewing experience. Get ready to take your projects to the next level with this smart and portable machine.",
    "tagline": "Unleash limitless productivity on the go.",
    "highlights": [
      "Copilot+ PC for optimized performance and time-saving experiences",
      "Qualcomm Hexagon NPU for smooth operation of AI-powered apps",
      "SnapdragonX Plus processor for powerful performance and AI acceleration",
      "PixelSense Flow LED touchscreen display for immersive visuals",
      "Up to 23 hours of battery life for uninterrupted usage anywhere"
    ]
  },
  {
    "id": "bestbuy-17698607",
    "category": "Laptops",
    "title": "Acer Aspire Go 15.6\" Laptop - Silver (Intel N100/128GB SSD/4GB RAM/Windows 11)",
    "price": "$299.99",
    "description": "Meet your day-to-day computing needs effortlessly with this Acer Aspire Go 15.6\" laptop. It is built with Intel N100 processor and 4GB DDR5 RAM for highly efficient performance. The 15.6-inch LCD display gives you immersive viewing experience and the 128GB solid state drive takes care of your storage needs. Integrated Bluetooth 5.1 allows for convenient wireless connectivity.",
    "features": [
      "Laptop",
      "AC Adapter",
      "Power Cord",
      "Intel N100 processor and 4GB DDR5 RAM combine to make this laptop fast and efficient",
      "128GB solid state drive provides reliable storage space with faster read and write time",
      "15.6-inch LCD display with 1920 x 1080 resolution gives you high quality pictures",
      "Integrated Wi-Fi 6 (802.11ax) (featuring dual-band 2.4GHz and 5GHz) and Bluetooth 5.1 provide convenient options for wireless connectivity",
      "Lithium-ion battery with 8.5 hours of approximate battery life makes you least worried about recharging and related hassles",
      "One USB Type-C port - supporting USB3.2 (up to 10 Gbps), DisplayPort, USB charging, two USB 3.2 Gen 1 ports, one HDMI 2.1 port with HDCP support, and headphone/speaker jack offer multiple options for connecting external devices",
      "Preinstalled with Windows 11 operating system that has easy user interface, improved features, and enhanced security"
    ],
    "url": "https://bestbuy.ca/en-ca/product/acer-aspire-go-15-6-laptop-silver-intel-n100-128gb-ssd-4gb-ram-windows-11/17698607",
    "rating": "3.1",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:15:56.702896",
    "summary": "Effortlessly meet your computing needs with the Acer Aspire Go 15.6\" laptop featuring an Intel N100 processor, 4GB RAM, and a 128GB SSD for efficient performance. Enjoy immersive viewing on the 15.6-inch LCD display, stay connected with Wi-Fi 6 and Bluetooth 5.1, and experience seamless connectivity with multiple ports for external devices. This laptop, preinstalled with Windows 11, ensures a user-friendly interface with enhanced security features, making it a reliable choice for your daily tasks.",
    "tagline": "Effortless Efficiency, Anywhere, Anytime.",
    "highlights": [
      "Intel N100 processor and 4GB DDR5 RAM for fast and efficient performance",
      "128GB solid state drive for reliable and speedy storage",
      "15.6-inch LCD display with high-quality resolution for immersive viewing",
      "Integrated Wi-Fi 6 and Bluetooth 5.1 for convenient wireless connectivity",
      "Windows 11 preinstalled for enhanced security and user-friendly interface"
    ]
  },
  {
    "id": "bestbuy-18965633",
    "category": "Laptops",
    "title": "ASUS TUF Gaming A15 15.6\" Gaming Laptop - Graphite Black (AMD Ryzen 5 7535HS/16GB RAM/1TB SSD/GeForce RTX 3050)",
    "price": "$1299.99",
    "description": "Dominate every game with the ASUS TUF A15 15.6-inch gaming laptop. Powered by an AMD Ryzen 5 7535HS processor and 16GB DDR5 RAM, it delivers lightning-fast performance, seamless multitasking, and smooth gameplay. Built to last, it meets the rigorous MIL-STD-810H military standard, ensuring durability against drops, vibrations, humidity, and extreme temperatures.",
    "features": [
      "180W AC Adapter",
      "AMD Ryzen 5 7535HS (up to 4.55 GHz) processor and 16GB DDR5 RAM deliver exceptional speed and multitasking efficiency",
      "1TB solid state drive offers lightning-fast read and write speeds and ample storage for games, apps, and media",
      "NVIDIA GeForce RTX 3050 4GB GDDR6 GPU at 75W with Dynamic Boost enables silky smooth graphics, delivering enhanced visuals and fluid gameplay",
      "15.6-inch screen with 1920 x 1080 resolution and 144Hz refresh rate offers crisp visuals and ultra-smooth gameplay",
      "Wi-Fi 6 (802.11ax) (dual band) 2 x 2 and Bluetooth 5.3 wireless card provide reliable options for wireless connectivity",
      "One RJ45 LAN port, three USB 3.2 Gen 1 Type-A, one USB Type C with DisplayPort support, one HDMI 2.1 TMDS, and one 3.5mm combo audio jack offers plenty of options to connect external devices",
      "Built to meet the durable MIL-STD-810H military standard to withstands drops, vibrations, humidity, and extreme temperatures",
      "Preinstalled with Windows 11 Home operating system that features easy user interface and offers improved performance and enhanced security"
    ],
    "url": "https://bestbuy.ca/en-ca/product/asus-tuf-gaming-a15-15-6-gaming-laptop-graphite-black-amd-ryzen-5-7535hs-16gb-ram-1tb-ssd-geforce-rtx-3050/18965633",
    "rating": "4.0",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:16:30.999210",
    "summary": "Dominate every game with the ASUS TUF A15 15.6-inch gaming laptop featuring an AMD Ryzen 5 7535HS processor, 16GB DDR5 RAM, and NVIDIA GeForce RTX 3050 GPU for exceptional speed and silky smooth graphics. With a durable MIL-STD-810H military standard construction, 1TB SSD, and Windows 11 Home OS, this laptop offers lightning-fast performance, ample storage, and enhanced security for an unbeatable gaming experience.",
    "tagline": "Unleash Victory: Power, Speed, and Durability in Every Game.",
    "highlights": [
      "Lightning-fast performance with AMD Ryzen 5 7535HS processor",
      "Silky smooth graphics with NVIDIA GeForce RTX 3050 GPU",
      "Military-grade durability against drops, vibrations, and extreme temperatures",
      "Ample storage and speed with 1TB SSD and 16GB DDR5 RAM",
      "Seamless connectivity options with Wi-Fi 6 and Bluetooth 5.3"
    ]
  },
  {
    "id": "bestbuy-19205139",
    "category": "Laptops",
    "title": "Apple MacBook Air 13.6\" w/ Touch ID (2025) - Midnight (Apple M4 / 16GB RAM / 256GB SSD) - English",
    "price": "$1399.99",
    "description": "The 13-inch MacBook Air with the M4 chip lets you fly through work and play. With Apple Intelligence,1 a brilliant Liquid Retina display, up to 18 hours of battery life,2 and a strikingly thin and light design, it’s built to last and can take on just about anything, anywhere.",
    "features": [
      "13\" MacBook Air",
      "30W USB‑C Power Adapter",
      "USB‑C to MagSafe 3 Cable (2 m)",
      "Supercharged by M4—the Apple M4 chip brings even more speed and fluidity to everything you do, like working across multiple apps, editing videos or playing graphically demanding games",
      "Built for Apple Intelligence—Apple Intelligence is the personal intelligence system that helps you write, express yourself and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data—not even Apple1",
      "Up to 18 hours of battery life—MacBook Air delivers the same amazing performance whether it’s running on battery or plugged in2",
      "Superlight and less than half an inch thin, MacBook Air fits easily into your bag—and your on-the-go lifestyle",
      "The 13.6-inch Liquid Retina display supports one billion colours.3 Photos and videos pop with rich contrast and sharp detail, and text appears supercrisp",
      "Everything looks and sounds amazing with a 12MP Center Stage camera, three mics and four speakers with Spatial Audio",
      "MacBook Air features two Thunderbolt 4 ports, a MagSafe charging port, a headphone jack, Wi-Fi 6E and Bluetooth 5.3. And it supports up to two external displays",
      "All your favourites run lightning fast in macOS, including Microsoft 365, Adobe Creative Cloud and Google Workspace4",
      "Mac works like magic with your other Apple devices. View and control what’s on your iPhone from your Mac with iPhone Mirroring5. Copy something on iPhone and paste it on Mac. Send texts with Messages or use your Mac to make and answer FaceTime calls6"
    ],
    "url": "https://bestbuy.ca/en-ca/product/apple-macbook-air-13-6-w-touch-id-2025-midnight-apple-m4-16gb-ram-256gb-ssd-english/19205139",
    "rating": "4.9",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:17:04.521680",
    "summary": "Experience unparalleled speed and efficiency with the 13-inch MacBook Air, powered by the cutting-edge M4 chip. Boasting up to 18 hours of battery life and a stunning Liquid Retina display, this superlight and ultra-thin device is perfect for work and play on the go. With innovative features like Apple Intelligence and seamless integration with other Apple devices, the MacBook Air is a versatile powerhouse for all your productivity needs.",
    "tagline": "Unleash Limitless Power with MacBook Air M4",
    "highlights": [
      "Supercharged by M4 chip for lightning-fast performance",
      "Built for Apple Intelligence with enhanced privacy protection",
      "Up to 18 hours of battery life for all-day productivity",
      "Ultra-thin and lightweight design for portability",
      "Stunning Liquid Retina display for vivid visuals and crisp text"
    ]
  },
  {
    "id": "bestbuy-18486669",
    "category": "Laptops",
    "title": "Acer Aspire Go 15.6\" Laptop - Silver (Intel N100/8GB RAM/512GB SSD/Windows 11)",
    "price": "$399.99",
    "description": "The Acer Aspire Go 15.6-inch laptop has everything you need to stay productive and entertained. Equipped with an Intel N100 processor, 8GB of RAM, and a fast 512GB SSD, this laptop is built to help you breeze through tasks. The 15.6-inch FHD display delivers crisp visuals for work, study, or streaming. Windows Copilot provides AI assistance to keep things running smoothly.",
    "features": [
      "Laptop",
      "AC Adapter",
      "Power Cord",
      "Intel N100 processor, paired with 8GB of RAM, ensures smooth multitasking and responsive performance",
      "512GB SSD offers ample space for all your files, while ensuring faster load times and quick access to data",
      "15.6-inch FHD display with 1920 x 1080 resolution delivers stunning clarity for an immersive visual experience",
      "Wi-Fi 6 (802.11ax) with dual-band (2.4GHz and 5GHz) support and 1 x 1 MU-MIMO technology ensures fast and reliable internet for enhanced performance in busy networks",
      "Bluetooth 5.1 or above offers faster data transfer speeds and improved connectivity with compatible devices",
      "Lithium-ion battery offers up to 8.5 hours of runtime for extended productivity",
      "Features one USB Type-CTM port USB 3.2 Gen 2 (up to 10Gbps) DisplayPort over USB Type-C and USB Charging, two USB 3.2 Gen 1 Ports, Display Port through USB-C, one HDMI 2.1 port with HDCP support, one Headphone/Speaker/Line-Out Jack, one Kensington Lock Slot, and one DC-in Jack for AC adapter for versatile connectivity",
      "Preloaded with Windows 11 operating system, offering advanced features and enhancements to elevate your computing experience"
    ],
    "url": "https://bestbuy.ca/en-ca/product/acer-aspire-go-15-6-laptop-silver-intel-n100-8gb-ram-512gb-ssd-windows-11/18486669",
    "rating": "4.6",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T12:17:39.032228",
    "summary": "Maximize your productivity and entertainment with the Acer Aspire Go 15.6-inch laptop featuring an Intel N100 processor, 8GB RAM, and a speedy 512GB SSD. Enjoy crisp visuals on the FHD display, fast internet connectivity with Wi-Fi 6, and seamless multitasking with Windows Copilot AI assistance. Elevate your computing experience with Windows 11 preloaded and stay connected with versatile connectivity options.",
    "tagline": "Unleash Productivity with Acer Aspire Go Laptop",
    "highlights": [
      "Intel N100 processor and 8GB RAM for smooth multitasking",
      "512GB SSD for fast data access and ample storage",
      "15.6-inch FHD display for stunning visual clarity",
      "Wi-Fi 6 technology for fast and reliable internet connectivity",
      "Up to 8.5 hours of battery life for extended productivity"
    ]
  }
]