[
  {
    "id": "bestbuy-18965633",
    "category": "Laptops",
    "title": "ASUS TUF Gaming A15 15.6\" Gaming Laptop - Graphite Black (AMD Ryzen 5 7535HS/16GB RAM/1TB SSD/GeForce RTX 3050)",
    "price": "$1299.99",
    "description": "Dominate every game with the ASUS TUF A15 15.6-inch gaming laptop. Powered by an AMD Ryzen 5 7535HS processor and 16GB DDR5 RAM, it delivers lightning-fast performance, seamless multitasking, and smooth gameplay. Built to last, it meets the rigorous MIL-STD-810H military standard, ensuring durability against drops, vibrations, humidity, and extreme temperatures.",
    "features": [
      "180W AC Adapter",
      "AMD Ryzen 5 7535HS (up to 4.55 GHz) processor and 16GB DDR5 RAM deliver exceptional speed and multitasking efficiency",
      "1TB solid state drive offers lightning-fast read and write speeds and ample storage for games, apps, and media",
      "NVIDIA GeForce RTX 3050 4GB GDDR6 GPU at 75W with Dynamic Boost enables silky smooth graphics, delivering enhanced visuals and fluid gameplay",
      "15.6-inch screen with 1920 x 1080 resolution and 144Hz refresh rate offers crisp visuals and ultra-smooth gameplay",
      "Wi-Fi 6 (802.11ax) (dual band) 2 x 2 and Bluetooth 5.3 wireless card provide reliable options for wireless connectivity",
      "One RJ45 LAN port, three USB 3.2 Gen 1 Type-A, one USB Type C with DisplayPort support, one HDMI 2.1 TMDS, and one 3.5mm combo audio jack offers plenty of options to connect external devices",
      "Built to meet the durable MIL-STD-810H military standard to withstands drops, vibrations, humidity, and extreme temperatures",
      "Preinstalled with Windows 11 Home operating system that features easy user interface and offers improved performance and enhanced security"
    ],
    "url": "https://bestbuy.ca/en-ca/product/asus-tuf-gaming-a15-15-6-gaming-laptop-graphite-black-amd-ryzen-5-7535hs-16gb-ram-1tb-ssd-geforce-rtx-3050/18965633",
    "rating": "4.0",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:18:51.822105",
    "summary": "Unleash your gaming potential with the ASUS TUF A15 15.6-inch gaming laptop, featuring a powerful AMD Ryzen 5 7535HS processor, 16GB DDR5 RAM, and a lightning-fast 1TB SSD for seamless multitasking and ample storage. Enjoy stunning visuals and smooth gameplay with the NVIDIA GeForce RTX 3050 GPU and a 144Hz display, all housed in a rugged design that meets military durability standards. Experience reliable connectivity with Wi-Fi 6 and a variety of ports, all powered by Windows 11 for enhanced performance and security.",
    "tagline": "Conquer every challenge with ASUS TUF Gaming A15.",
    "highlights": [
      "Exceptional speed with AMD Ryzen 5 7535HS processor",
      "Seamless multitasking powered by 16GB DDR5 RAM",
      "Lightning-fast 1TB SSD storage for all your games",
      "Stunning visuals with NVIDIA GeForce RTX 3050 GPU",
      "Crisp 15.6-inch display at 144Hz refresh rate",
      "Reliable Wi-Fi 6 and Bluetooth 5.3 connectivity",
      "Versatile ports for all your external devices",
      "Built to withstand tough conditions with MIL-STD-810H durability",
      "Preinstalled Windows 11 for enhanced performance and security."
    ]
  },
  {
    "id": "bestbuy-18965777",
    "category": "Laptops",
    "title": "Dell Inspiron 15 15.6\" Touchscreen Laptop (Intel Core i7 1355U/16GB RAM/1TB SSD/Windows 11)",
    "price": "$1099.99",
    "description": "Enjoy seamless computing wherever you go with the Dell Inspiron 15 15.6-inch touchscreen laptop. Powered by an Intel Core i7 1355U processor and 16GB RAM, it delivers responsive performance and smooth multitasking. The lift hinge ensures an ergonomic typing angle, while the built-in HD webcam lets you enjoy high-quality video chats.",
    "features": [
      "Notebook",
      "Power Adapter",
      "Power Cord",
      "Documentation",
      "Intel Core i7 1355U processor and 16GB RAM deliver fast and efficient performance, for smooth multitasking and quick responsiveness",
      "1TB solid state drive offers fast data access, quick boot times, and enormous storage",
      "15.6-inch touchscreen display with 1920 x 1080 resolution delivers sharp, clear visuals, providing an immersive viewing experience for work, entertainment, and gaming",
      "Realtek Wi-Fi 6 RTL8852BE, 2 x 2, 802.11ax, MU-MIMO and Bluetooth wireless card offer improved wireless connectivity",
      "41Wh, lithium-ion battery keeps you least worried about frequent recharging",
      "One USB 3.2 Gen 1 Type-A, one USB 3.2 Gen 1 Type-C (data only), one USB 2.0 Type-A, HDMI, one combo jack (headphone/microphone) provide plenty of options for connecting external devices",
      "Spacious keypads, separate numeric keypad and calculator hotkey let you complete tasks quickly",
      "Built-in HD webcam provides high-quality video chatting experience",
      "ComfortView software (a TUV Rheinland certified solution), reduces harmful blue light emissions to ensure your eyes stay comfortable during long viewing sessions",
      "Windows 11 Home (S mode) offers enhanced security and performance by allowing apps only from the Microsoft Store, providing a safe, fast, and more streamlined computing experience"
    ],
    "url": "https://bestbuy.ca/en-ca/product/dell-inspiron-15-15-6-touchscreen-laptop-intel-core-i7-1355u-16gb-ram-1tb-ssd-windows-11/18965777",
    "rating": "5.0",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:19:26.610429",
    "summary": "Experience unparalleled performance on the go with the Dell Inspiron 15, featuring a powerful Intel Core i7 1355U processor, 16GB RAM, and a stunning 15.6-inch touchscreen display. With a spacious 1TB SSD for rapid data access, versatile connectivity options, and an ergonomic design, this laptop is perfect for seamless multitasking, gaming, and video calls. Enjoy enhanced comfort and security with ComfortView technology and Windows 11 Home, making your computing experience both efficient and enjoyable.",
    "tagline": "Discover Dynamic Performance with Dell Inspiron 15 Touchscreen Laptop.",
    "highlights": [
      "Intel Core i7 processor for fast, efficient multitasking.",
      "16GB RAM ensures smooth performance across applications.",
      "1TB SSD for quick data access and ample storage.",
      "15.6-inch touchscreen with 1920 x 1080 resolution.",
      "Enhanced connectivity with Wi-Fi 6 and Bluetooth.",
      "Ergonomic lift hinge for comfortable typing.",
      "Built-in HD webcam for high-quality video chats.",
      "ComfortView software reduces eye strain during long sessions.",
      "Windows 11 Home for secure and streamlined computing.",
      "Versatile connectivity options with multiple USB ports."
    ]
  },
  {
    "id": "bestbuy-18924291",
    "category": "Laptops",
    "title": "Open Box - Lenovo Legion 5 16\" Gaming Laptop (Intel Core i9-14900HX/32GB RAM/1TB SSD/NVIDIA GeForce RTX 4060 8GB GDDR6/Windows 11) - Luna Grey",
    "price": "$1799.99",
    "description": "The Lenovo Legion 5 16\" Gaming Laptop in Luna Grey is a high-performance machine built for gamers and power users. It features the Intel Core i9-14900HX processor, 32GB of RAM, a 1TB SSD, and an NVIDIA GeForce RTX 4060 GPU with 8GB GDDR6. This powerhouse delivers exceptional gaming performance, ultra-smooth multitasking, and fast load times, while the 16-inch display provides immersive visuals. With Windows 11, you get a modern OS optimized for both gaming and productivity.",
    "features": [],
    "url": "https://bestbuy.ca/en-ca/product/open-box-lenovo-legion-5-16-gaming-laptop-intel-core-i9-14900hx-32gb-ram-1tb-ssd-nvidia-geforce-rtx-4060-8gb-gddr6-windows-11-luna-grey/18924291",
    "rating": "4.5",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:20:01.233369",
    "summary": "Unleash your gaming potential with the Lenovo Legion 5 16\" Gaming Laptop in Luna Grey, featuring a cutting-edge Intel Core i9-14900HX processor, 32GB of RAM, and a blazing-fast 1TB SSD. Experience stunning graphics with the NVIDIA GeForce RTX 4060 GPU, ensuring exceptional performance for both gaming and multitasking. With Windows 11, enjoy seamless productivity and immersive visuals on a striking 16-inch display—this is the ultimate machine for serious gamers and power users alike.",
    "tagline": "Dominate every game with Lenovo Legion 5's power.",
    "highlights": [
      "Intel Core i9-14900HX for lightning-fast performance",
      "Stunning 16\" display for immersive gaming",
      "32GB RAM for seamless multitasking",
      "1TB SSD for rapid load times",
      "NVIDIA GeForce RTX 4060 for breathtaking graphics",
      "Optimized with Windows 11 for gaming and productivity"
    ]
  },
  {
    "id": "bestbuy-19205139",
    "category": "Laptops",
    "title": "Apple MacBook Air 13.6\" w/ Touch ID (2025) - Midnight (Apple M4 / 16GB RAM / 256GB SSD) - English",
    "price": "$1399.99",
    "description": "The 13-inch MacBook Air with the M4 chip lets you fly through work and play. With Apple Intelligence,1 a brilliant Liquid Retina display, up to 18 hours of battery life,2 and a strikingly thin and light design, it’s built to last and can take on just about anything, anywhere.",
    "features": [
      "13\" MacBook Air",
      "30W USB‑C Power Adapter",
      "USB‑C to MagSafe 3 Cable (2 m)",
      "Supercharged by M4—the Apple M4 chip brings even more speed and fluidity to everything you do, like working across multiple apps, editing videos or playing graphically demanding games",
      "Built for Apple Intelligence—Apple Intelligence is the personal intelligence system that helps you write, express yourself and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data—not even Apple1",
      "Up to 18 hours of battery life—MacBook Air delivers the same amazing performance whether it’s running on battery or plugged in2",
      "Superlight and less than half an inch thin, MacBook Air fits easily into your bag—and your on-the-go lifestyle",
      "The 13.6-inch Liquid Retina display supports one billion colours.3 Photos and videos pop with rich contrast and sharp detail, and text appears supercrisp",
      "Everything looks and sounds amazing with a 12MP Center Stage camera, three mics and four speakers with Spatial Audio",
      "MacBook Air features two Thunderbolt 4 ports, a MagSafe charging port, a headphone jack, Wi-Fi 6E and Bluetooth 5.3. And it supports up to two external displays",
      "All your favourites run lightning fast in macOS, including Microsoft 365, Adobe Creative Cloud and Google Workspace4",
      "Mac works like magic with your other Apple devices. View and control what’s on your iPhone from your Mac with iPhone Mirroring5. Copy something on iPhone and paste it on Mac. Send texts with Messages or use your Mac to make and answer FaceTime calls6"
    ],
    "url": "https://bestbuy.ca/en-ca/product/apple-macbook-air-13-6-w-touch-id-2025-midnight-apple-m4-16gb-ram-256gb-ssd-english/19205139",
    "rating": "4.9",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:20:36.106338",
    "summary": "Experience unparalleled performance with the 13-inch MacBook Air powered by the M4 chip, designed for both work and play. Enjoy up to 18 hours of battery life, a stunning Liquid Retina display that supports one billion colors, and seamless integration with your Apple devices. Ultra-light and incredibly thin, this laptop is perfect for your on-the-go lifestyle, ensuring you stay productive and entertained anywhere you are.",
    "tagline": "Experience unmatched performance with the 13.6\" MacBook Air.",
    "highlights": [
      "Supercharged by the M4 chip for seamless multitasking",
      "Brilliant Liquid Retina display with one billion colors",
      "Up to 18 hours of battery life for all-day productivity",
      "Ultra-thin and lightweight design for on-the-go convenience",
      "Built-in Apple Intelligence for effortless creativity and organization",
      "Stunning audio and video quality with advanced camera and speakers",
      "Connects effortlessly with other Apple devices for a seamless experience"
    ]
  },
  {
    "id": "bestbuy-18602066",
    "category": "Laptops",
    "title": "HP OmniBook X 14\" Gen AI PC Laptop - Glacier Silver (Snapdragon X Plus/16GB RAM/1TB SSD/Windows 11 Home)",
    "price": "$1349.99",
    "description": "Enhance your computing experience with the HP OmniBook X 14-inch Gen AI PC laptop. It features a Snapdragon X Plus processor, 16GB DDR4 RAM, and 1TB solid state drive for fast performance and ample storage. This laptop has a 5MP IR camera with noise reduction and dual-array digital microphones for crystal-clear video and audio quality.",
    "features": [
      "HP OmniBook X Laptop 14-fe1008ca",
      "65 W USB Type-C Power Adapter",
      "Snapdragon X Plus X1P-42-100 processor (up to 3.4GHz, eight cores) delivers high power and efficient performance",
      "16GB LPDDR5x-8448 MT/s (onboard) RAM provides fast, efficient multitasking and improved system performance",
      "1TB PCIe NVMe M.2 solid state drive offers ample storage space with enhanced read and write speeds",
      "14-inch diagonal IPS display with 2.2K (2240 x 1400), edge-to-edge glass and micro-edge design provides high-resolution visuals",
      "Integrated Qualcomm FastConnect 6900 Wi-Fi 6E (2 x 2) Dual Band Simultaneous (DBS) and Bluetooth 5.3 wireless card provide fast and reliable connectivity",
      "Three-cell lithium-ion polymer 59Wh battery offers extended battery life of 24 hours to stay productive without the need for constant recharge",
      "Lightweight design weighing 2.97lb. (1.34kg) makes this laptop extremely portable",
      "Dual speakers, HP Audio Boost, and Poly Studio offer enhanced sound quality",
      "Equipped with two USB Type-C ports and one USB Type-A port for versatile connectivity options",
      "Boasts a USB Type-A port with a 10Gbps signalling rate (HP Sleep and Charge), a USB Type-C port with a 10Gbps signalling rate (USB Power Delivery, DisplayPort 1.4a, HP sleep and charge), a USB Type-C port with a 40Gbps signalling rate (USB Power Delivery, DisplayPort 1.4a, HP sleep and charge), and a headphone and microphone combo for added convenience",
      "5MP IR camera with temporal noise reduction and integrated dual-array digital microphones delivers clear, high-quality video and audio",
      "Low Blue Light technology promotes comfortable viewing experience for extended periods",
      "Corning Gorilla Glass 3 provides superior scratch and damage resistance",
      "Preinstalled with Windows 11 Home operating system for optimal performance and security",
      "Includes a full-size, backlit keyboard to improve your typing experience even in low light conditions"
    ],
    "url": "https://bestbuy.ca/en-ca/product/hp-omnibook-x-14-gen-ai-pc-laptop-glacier-silver-snapdragon-x-plus-16gb-ram-1tb-ssd-windows-11-home/18602066",
    "rating": "4.3",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:21:11.286280",
    "summary": "Elevate your computing experience with the HP OmniBook X 14-inch Gen AI PC laptop, featuring a powerful Snapdragon X Plus processor, 16GB of RAM, and a 1TB SSD for lightning-fast performance and ample storage. Its stunning 2.2K IPS display, crystal-clear 5MP IR camera, and features like low blue light technology and a backlit keyboard make it perfect for both work and play. With extended battery life, lightweight design, and versatile connectivity options, the HP OmniBook X is the ultimate laptop for those on the go.",
    "tagline": "Experience Unmatched Power with HP OmniBook X 14\" Laptop.",
    "highlights": [
      "Snapdragon X Plus processor for lightning-fast performance.",
      "16GB RAM for seamless multitasking and responsiveness.",
      "1TB SSD for extensive storage and quick access.",
      "Stunning 2.2K display for vibrant visuals.",
      "24-hour battery life to keep you productive on the go.",
      "Dual-array microphones for crystal-clear communication.",
      "Lightweight and portable design at just 2.97lbs.",
      "Versatile connectivity with multiple USB ports.",
      "Backlit keyboard for comfortable typing in any lighting.",
      "Windows 11 Home for enhanced security and performance."
    ]
  },
  {
    "id": "bestbuy-17631509",
    "category": "Laptops",
    "title": "ASUS Vivobook 14 Flip 14\" Touchscreen 2-in-1 Laptop - Quiet Blue (Intel Core i5-1335U/512GB SSD/8GB RAM/Win 11)",
    "price": "$699.95",
    "description": "Powerful and flexible, the ASUS Vivobook 14 Flip two-in-one laptop keeps you going in full form anywhere, anytime. Its Intel Core i5-1335U processor and 8GB DDR4 RAM combine to deliver a highly efficient performance. With 512GB solid state drive, you will have more space for storing your files and media. The NumberPad helps you quickly perform data entry works.",
    "features": [
      "Adapter",
      "User E-Manual",
      "Warranty Card",
      "Intel Core i5-1335U processor and 8GB DDR4 RAM make this laptop fast and powerful",
      "512GB solid state drive offers reliable storage space for your files and programs",
      "14-inch LED touchscreen display with 1920 x 1080 resolution enhances your viewing experience and overall user experience",
      "Wi-Fi 6E (802.11ax) (dual band) 2 x 2 and Bluetooth 5.3 wireless card provide reliable options for wireless connectivity",
      "Three-cell, lithium-ion battery with 50Wh capacity makes you worry less about recharging and related hassles",
      "One USB 2.0 type-A, one USB 3.2 Gen 2 Type-A, one USB 3.2 Gen 2 Type-C support display / Power Delivery, one HDMI 2.1 TMDS, and one 3.5mm combo audio jack offer multiple ways to connect external devices",
      "Two-in-one convertible design makes this laptop flexible enough to be used in different ways",
      "NumberPad lets you do data entry tasks quickly",
      "FHD camera with privacy shutter improves your convenience and safety",
      "Preinstalled with Windows 11 Home operating system that features easy user interface, improved performance, and enhanced security"
    ],
    "url": "https://bestbuy.ca/en-ca/product/asus-vivobook-14-flip-14-touchscreen-2-in-1-laptop-quiet-blue-intel-core-i5-1335u-512gb-ssd-8gb-ram-win-11/17631509",
    "rating": "0",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:21:44.040584",
    "summary": "Experience ultimate versatility and performance with the ASUS Vivobook 14 Flip two-in-one laptop, featuring an Intel Core i5-1335U processor and 8GB DDR4 RAM for seamless efficiency. Store all your essential files on its spacious 512GB SSD while enjoying vibrant visuals on the 14-inch FHD touchscreen. With a flexible design, advanced connectivity, and long-lasting battery, this laptop is your ideal companion for work and play anywhere, anytime.",
    "tagline": "Transform your workflow with ASUS Vivobook 14 Flip's versatility.",
    "highlights": [
      "Fast performance with Intel Core i5-1335U and 8GB RAM",
      "Ample storage with 512GB SSD for all your files",
      "Stunning visuals on a 14-inch FHD touchscreen",
      "Reliable connectivity with Wi-Fi 6E and Bluetooth 5.3",
      "Flexible two-in-one design adapts to your needs",
      "Quick data entry with integrated NumberPad",
      "Enhanced privacy with FHD camera and shutter",
      "Preinstalled Windows 11 for a user-friendly experience"
    ]
  },
  {
    "id": "bestbuy-18885840",
    "category": "Laptops",
    "title": "Lenovo IdeaPad 1i 14\" Laptop - Abyss Blue (Intel Celeron N4500/4GB RAM/128GB SSD/Windows 11)",
    "price": "$199.99",
    "description": "Experience excellent performance with the Lenovo IdeaPad 1i laptop. Powered by the Intel Celeron N4500 processor and 4GB of RAM, this laptop lets you multitask efficiently. The 14-inch HD display offers clear, sharp visuals, while Dolby Audio speakers deliver rich, immersive sound.",
    "features": [
      "Computer",
      "User Guide",
      "45W Charger",
      "Intel Celeron N4500 processor and 4GB of RAM lets you easily manage multiple tasks with reliable performance",
      "128GB eMMC storage provides sufficient space for your files and documents",
      "14-inch HD display with 1366 x 768 resolution, offers a crisp viewing experience",
      "Wi-Fi 6 (802.11ax) and Bluetooth 5.2 offer reliable connectivity options for networking",
      "Stay productive with up to 11 hours of battery life and rapid charging",
      "One USB 2.0, one USB 3.2 Gen 1, one USB-C 3.2 Gen 1 (support data transfer only), one HDMI, and four-in-one (SD, SDHC, SDXC, MMC) card reader offer versatile connectivity options for peripherals",
      "Thin and compact 0.7-inch chassis makes the laptop highly portable",
      "Two Dolby Audio speakers deliver rich, clear sound for your entertainment needs and video calls",
      "720p webcam and Smart Noise Cancelling effectively enhance your video call experience",
      "Flip to Start feature powers on your laptop instantly when you open the lid",
      "Windows 11 in S mode offers enhanced security and performance with apps only from the Microsoft Store"
    ],
    "url": "https://bestbuy.ca/en-ca/product/lenovo-ideapad-1i-14-laptop-abyss-blue-intel-celeron-n4500-4gb-ram-128gb-ssd-windows-11/18885840",
    "rating": "3.8",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:22:19.016007",
    "summary": "Experience seamless multitasking with the Lenovo IdeaPad 1i laptop, powered by an Intel Celeron N4500 processor and 4GB of RAM, perfect for your everyday tasks. Its 14-inch HD display and Dolby Audio speakers ensure an immersive viewing and listening experience, while the lightweight design and impressive 11-hour battery life make it an ideal companion for on-the-go productivity. Plus, with advanced Wi-Fi 6 connectivity and versatile ports, staying connected has never been easier.",
    "tagline": "Maximize productivity on the go with Lenovo IdeaPad 1i.",
    "highlights": [
      "Efficient multitasking powered by Intel Celeron N4500 and 4GB RAM",
      "Crisp visuals on a 14-inch HD display",
      "Immersive sound from Dolby Audio speakers",
      "Up to 11 hours of battery life for all-day use",
      "Versatile connectivity with multiple USB ports and HDMI",
      "Lightweight design at just 0.7 inches thick",
      "Smart Noise Cancelling for enhanced video calls",
      "Instant power-on with Flip to Start feature",
      "Secure and streamlined experience with Windows 11 in S mode"
    ]
  },
  {
    "id": "bestbuy-19263403",
    "category": "Laptops",
    "title": "Microsoft Surface Pro (LCD) Copilot+ PC 12\" 512GB Tablet with Snapdragon X Plus/16GB RAM (2025) - Ocean - Device Only",
    "price": "$1349.99",
    "description": "Stay productive and creative, on the go, with this ultra-thin Microsoft Surface Pro 12\" tablet. Light and flexible, you can use it as a tablet or turn it into a laptop for comfortable typing1. Featuring an immersive PixelSense Flow LCD touchscreen and Qualcomm Snapdragon X Plus processor, this machine helps you do more in less time. Plus, possibilities are endless with advanced AI capabilities.",
    "features": [
      "Device",
      "USB-C Charging Cable",
      "QSG",
      "Safety And Warranty Documents (No Charger Included)",
      "Enjoy exclusive Copilot+ PC experiences for productivity and efficiency boosts (on some devices, Copilot+ PC experiences require free updates available starting later this year and continuing into 2025)",
      "Powered by the Qualcomm Snapdragon X Plus (eight core) processor, delivering powerful performance and AI accelerated power",
      "Features turbocharged Qualcomm Hexagon NPU that delivers up to 45 TOPs designed to accelerate AI experiences",
      "12-inch tablet with PixelSense Flow LCD touchscreen display offers stunning, vibrant visuals and image quality",
      "Stay in the flow—whether you're streaming shows, YouTube, movies, or even video calls, enjoy up to 16 hours of battery (battery life varies significantly based on usage, network and feature configuration, signal strength, settings and other factors)",
      "Charge on-the-go, transfer data fast, or create the ultimate desktop set up with two USB-C 3.2 ports (USB4 and USB-C are registered trademarks of USB Implementers Forum)",
      "Store and charge Surface Slim Pen1 directly in the new pen storage area on the back of Surface Pro",
      "Designed to be a laptop or a tablet, the built-in 165-degree fluid kickstand offers flexibility at any angle",
      "Pair with a Surface Pro 12-inch keyboard1 to turn it into a full thin and light Windows laptop with a comfortable typing and touchpad experience",
      "Instantly access your device using facial recognition with Windows Hello; fast, personal, secure and no password needed",
      "Power supply is now sold separately to support Microsoft's sustainability promise"
    ],
    "url": "https://bestbuy.ca/en-ca/product/microsoft-surface-pro-lcd-copilot-pc-12-512gb-tablet-with-snapdragon-x-plus-16gb-ram-2025-ocean-device-only/19263403",
    "rating": "0",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:22:53.975464",
    "summary": "Stay productive and creative on the go with the ultra-thin Microsoft Surface Pro 12\" tablet, designed for versatility as both a tablet and a laptop. Featuring a stunning PixelSense Flow touchscreen, powerful Qualcomm Snapdragon X Plus processor, and up to 16 hours of battery life, this device enhances your efficiency with advanced AI capabilities. Experience seamless connectivity with dual USB-C ports and enjoy exclusive Copilot+ experiences for an unparalleled boost in productivity.",
    "tagline": "Stay Creative Anywhere with the Microsoft Surface Pro 12\".",
    "highlights": [
      "Ultra-thin and lightweight design for on-the-go productivity.",
      "Dual functionality as a tablet and laptop.",
      "Stunning PixelSense Flow LCD touchscreen for vibrant visuals.",
      "Powered by Qualcomm Snapdragon X Plus for seamless performance.",
      "Up to 16 hours of battery life for all-day use.",
      "Fast data transfer and charging with USB-C ports.",
      "Flexible 165-degree kickstand for comfortable viewing angles.",
      "Instant access with facial recognition via Windows Hello.",
      "Exclusive Copilot+ PC experiences for enhanced productivity.",
      "Built-in storage for Surface Slim Pen for ultimate convenience."
    ]
  },
  {
    "id": "bestbuy-19187159",
    "category": "Laptops",
    "title": "HP 15.6\" Laptop - Natural Silver (AMD Ryzen 7-7730U/16GB RAM/1TB SSD/Windows 11)",
    "price": "$999.99",
    "description": "The HP 15.6-inch laptop is designed to improve your productivity while on the move. With AMD Ryzen 7 7730U processor and 16GB of RAM, it delivers powerful performance for seamless multitasking. The 1TB of internal storage efficiently handles all your files, while dual speakers deliver rich audio. With up to 10 hours of battery life, you can enjoy hours of uninterrupted use.",
    "features": [
      "HP Laptop 15-fc0028ca",
      "45 W AC Power Adapter",
      "AMD Ryzen 7 7730U processor paired with 16GB of DDR4 RAM delivers exceptional performance, enabling fast multitasking and smooth handling of demanding tasks",
      "1TB solid state drive provides fast data access and ample storage space",
      "15.6-inch display with Full HD (1920 x 1080) resolution and three-sided narrow bezel offers clear and immersive visual experience",
      "Realtek Wi-Fi 6 (802.11ax) (2 x 2) and Bluetooth 5.4 wireless card provide reliable options for wireless connectivity",
      "Up to 10 hours of battery life, so you don't have to constantly recharge",
      "One USB Type-C 5Gbps signalling rate (supports data transfer only and does not support charging or external monitors), two USB Type-A 5Gbps signalling rate, one AC smart pin, one HDMI 1.4b, one headphone/microphone combo, and one HDMI out offer versatile connectivity options",
      "Dual speakers deliver clear sound to enhance your multimedia experience",
      "HP True Vision 720p HD camera featuring temporal noise reduction and built-in dual array digital microphones ensures clear video and audio",
      "Full-size keyboard offers a comfortable typing experience",
      "Built with recycled materials for eco-conscious approach",
      "Preinstalled with Windows 11 Home operating system that features easy user interface and offers improved performance and enhanced security"
    ],
    "url": "https://bestbuy.ca/en-ca/product/hp-15-6-laptop-natural-silver-amd-ryzen-7-7730u-16gb-ram-1tb-ssd-windows-11/19187159",
    "rating": "0",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:23:27.927886",
    "summary": "Elevate your productivity with the HP 15.6-inch laptop, powered by an AMD Ryzen 7 7730U processor and 16GB of RAM for seamless multitasking. With a stunning Full HD display, 1TB SSD for lightning-fast data access, and up to 10 hours of battery life, this laptop is perfect for on-the-go professionals. Experience rich audio, reliable connectivity, and a user-friendly Windows 11 operating system, all while supporting eco-conscious practices with its recycled materials.",
    "tagline": "Maximize productivity on the go with HP 15.6\" Laptop.",
    "highlights": [
      "Powerful AMD Ryzen 7 processor for seamless multitasking.",
      "16GB RAM for handling demanding tasks effortlessly.",
      "1TB SSD for fast data access and ample storage.",
      "Stunning Full HD display for immersive visuals.",
      "Reliable Wi-Fi 6 and Bluetooth 5.4 connectivity options.",
      "Up to 10 hours of battery life for all-day use.",
      "Versatile ports for enhanced connectivity.",
      "Clear audio from dual speakers for multimedia enjoyment.",
      "HP True Vision HD camera for crystal-clear video calls.",
      "Eco-friendly design built with recycled materials."
    ]
  },
  {
    "id": "bestbuy-17631508",
    "category": "Laptops",
    "title": "ASUS Vivobook 14 Flip 14\" Touchscreen 2-in-1 Laptop - Quiet Blue (Intel Core i7-13700H/16GB RAM/1TB SSD)",
    "price": "$999.95",
    "description": "Fast and responsive, the ASUS Vivobook 14 Flip 14\" Touchscreen two-in-one laptop seamlessly elevates your computing experience. It is powered by an Intel Core i7-13700H processor to deliver powerful performance for both work and entertainment. With a generous 1TB SSD and 16GB DDR4 RAM, this laptop ensures ample storage space and smooth multitasking capabilities.",
    "features": [
      "Adapter",
      "User E-Manual",
      "Warranty Card",
      "13th Gen Intel Core i7-13700H processor, boasting a high clock speed of 2.4GHz ensures swift and responsive performance for demanding tasks",
      "16GB DDR4 RAM provides ample memory for efficient handling of applications without any lag",
      "Spacious 1TB SSD stores all your files and applications, ensuring quicker system boot-ups and file transfers",
      "Intel Iris XE Graphics ensure vibrant visuals and unparalleled graphic performance for various applications",
      "Fourteen-inch WUXGA Touch display with 1920 x 1080 resolution delivers high-quality images and precise touch functionality for enhanced user experience",
      "Integrated Wi-Fi 6E (802.11ax) (Dual-band) 2 x 2 ensures fast and stable internet connectivity",
      "Bluetooth 5.3 wireless card facilitates seamless wireless communication with peripherals",
      "3S1P, 3-cell Li-ion battery with 50Wh capacity offers a reliable and long-lasting power source for your on-the-go computing needs",
      "One USB 2.0 Type-A, one USB 3.2 Gen 2 Type-A, one USB 3.2 Gen 2 Type-C Support Display / Power Delivery, one HDMI 2.1 TMDS, one 3.5mm combo audio jack, and one DC-in ports enable easy connectivity with a variety of devices",
      "1080p Full HD camera with privacy shutter ensures crystal-clear video calls and maintains privacy when the camera is not in use",
      "Backlit keyboard with NumberPad allows for efficient typing and calculations even in low-light conditions",
      "Pre-installed with Windows 11 Home OS to offer user-friendly interface, enhanced productivity features, and more"
    ],
    "url": "https://bestbuy.ca/en-ca/product/asus-vivobook-14-flip-14-touchscreen-2-in-1-laptop-quiet-blue-intel-core-i7-13700h-16gb-ram-1tb-ssd/17631508",
    "rating": "4.4",
    "source": "BestBuy",
    "scraped_at": "2025-05-30T17:24:03.820666",
    "summary": "Experience unmatched performance and versatility with the ASUS Vivobook 14 Flip, a powerful two-in-one laptop featuring a 13th Gen Intel Core i7-13700H processor, 16GB DDR4 RAM, and a spacious 1TB SSD for seamless multitasking and storage. Its stunning 14\" WUXGA touchscreen display, vibrant Intel Iris XE graphics, and long-lasting battery make it perfect for both work and entertainment, while the sleek design and comprehensive connectivity options enhance your on-the-go lifestyle. Elevate your computing experience today with the ASUS Vivobook 14 Flip!",
    "tagline": "Experience seamless multitasking with ASUS Vivobook 14 Flip!",
    "highlights": [
      "Powerful Intel Core i7-13700H for demanding tasks",
      "16GB DDR4 RAM for smooth multitasking",
      "1TB SSD for quick storage and boot-ups",
      "Stunning 14\" touchscreen with WUXGA resolution",
      "Fast Wi-Fi 6E and Bluetooth 5.3 connectivity",
      "Long-lasting 50Wh battery for on-the-go use",
      "Versatile ports for easy device connections",
      "Crystal-clear 1080p HD camera with privacy shutter",
      "Backlit keyboard for efficient typing in any light",
      "Windows 11 Home OS for enhanced productivity"
    ]
  }
]